In [2]:
import sqlite3
connection = sqlite3.connect('example.db')
cursor = connection.cursor()

In [3]:
cursor.execute(
'''
Create Table If Not Exists Employee(
    id Integer Primary Key,
    name Text Not Null,
    age Integer,
    dept Text
    )
'''
)
connection.commit()

In [9]:
cursor.execute(
'''
INSERT INTO Employee(id,name,age,dept)
VALUES (29,'titu',20,'CSE')
'''
)
# cursor.execute(
# '''
# INSERT INTO Employee(id,name,age,dept)
# VALUES (25,'paras',20,'EIE')
# '''
# )

In [10]:
cursor.execute(
'''
Select * from Employee
'''
)
cursor.fetchall()

[(23, 'Kunal', 20, 'CSE'), (29, 'titu', 20, 'CSE')]

In [12]:
data = [
    (30,'fdfa',23,'daf'),
    (299,'2323',423,'34242')
]
cursor.executemany(
'''
Insert INTO Employee(id,name,age,dept)
VALUES(?,?,?,?)
''',
data
)

In [14]:
cursor.execute('''SELECT * FROM Employee''')
cursor.fetchall()

[(23, 'Kunal', 20, 'CSE'),
 (29, 'titu', 20, 'CSE'),
 (30, 'fdfa', 23, 'daf'),
 (299, '2323', 423, '34242')]

In [15]:
connection.commit()

In [24]:
#update
cursor.execute(
'''
UPDATE Employee 
SET age = 50 
WHERE name = "fdfa"
'''
)
connection.commit()
cursor.execute('SELECT * FROM Employee')
rows = cursor.fetchall()
for row in rows:
    print(row)

(23, 'Kunal', 20, 'CSE')
(29, 'titu', 20, 'CSE')
(30, 'fdfa', 50, 'daf')
(299, '2323', 423, '34242')

In [25]:
#delete
cursor.execute(
'''
DELETE FROM Employee
WHERE name = "fdfa"
'''
)
connection.commit()
cursor.execute('SELECT * FROM Employee')
rows = cursor.fetchall()
for row in rows:
    print(row)

(23, 'Kunal', 20, 'CSE')
(29, 'titu', 20, 'CSE')
(299, '2323', 423, '34242')

In [30]:
#new table
new_connection = sqlite3.connect('sales.db')
new_cursor = connection.cursor()
new_cursor.execute(
'''
CREATE TABLE IF NOT EXISTS Sales(
    id INTEGER PRIMARY KEY,
    date TEXT NOT NULL,
    product TEXT NOT NULL,
    sales INTEGER,
    region TEXT
)
'''
)
connection.commit()

In [ ]:
sales_data = [
    (100,'30-01-2003','pqdhffe',399323,'north'),
    (101,'29-09-2993','dhadjfa',232,'east'),
    (102,'20-09-3393','shfafha',2323,'north'),
    (103,'01-12-3232','sahfafasf',23423,'west'),
    (104,'20-12-3423','fafbalf',23412,'south')
]
new_cursor.executemany(
'''
INSERT INTO Sales
VALUES(?,?,?,?,?)
''',
sales_data
)
new_connection.commit()

In [37]:
new_cursor.execute('SELECT * FROM Sales')
new_cursor.fetchall()

[(100, '30-01-2003', 'pqdhffe', 399323, 'north'),
 (101, '29-09-2993', 'dhadjfa', 232, 'east'),
 (102, '20-09-3393', 'shfafha', 2323, 'north'),
 (103, '01-12-3232', 'sahfafasf', 23423, 'west'),
 (104, '20-12-3423', 'fafbalf', 23412, 'south')]

In [38]:
#relation & foreign keys
query = (
'''
CREATE TABLE Doctor(
    id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    phoneno INTEGER,
    type TEXT
)
'''
)
cursor.execute(query)
connection.commit()

In [39]:
query = (
''' 
CREATE TABLE Patients(
    id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    email TEXT,
    phone INTEGER,
    problem TEXT,
    doc_id INTEGER NOT NULL,
    FOREIGN KEY(doc_id) REFERENCES Doctor(id)
)
'''
)
cursor.execute(query)
connection.commit()

In [40]:
doc_data = [
    (1,'john',24234242,'32ggdfs'),
    (2,'sfsdgs',3423423,'sdgsgsdf'),
    (3,'fgsfgs',32423,'fdsfbd'),
    (4,'gfgsdfgs',345345,'dfsggs')
]
patient_data = [
    (1,'gsgsg','ewgwergw',234234,'wertewtwe',1),
    (2,'regwerg','wrhwe e',23423,'eeffdsfverg',4),
    (3,'egergwe','gwgwergwg',34243242,'wegewrgwe',3),
    (4,'gwegwerg','ewgwergwe',3423423,'werferb',2)
]
cursor.executemany(
'''
INSERT INTO Doctor
VALUES(?,?,?,?)
''',doc_data
)
cursor.executemany(
'''
INSERT INTO Patients
VALUES(?,?,?,?,?,?)
''',patient_data
)
connection.commit()

In [41]:
cursor.execute('Select * from Doctor')
cursor.fetchall()

[(1, 'john', 24234242, '32ggdfs'),
 (2, 'sfsdgs', 3423423, 'sdgsgsdf'),
 (3, 'fgsfgs', 32423, 'fdsfbd'),
 (4, 'gfgsdfgs', 345345, 'dfsggs')]

In [42]:
cursor.execute('select * from Patients')
cursor.fetchall()

[(1, 'gsgsg', 'ewgwergw', 234234, 'wertewtwe', 1),
 (2, 'regwerg', 'wrhwe e', 23423, 'eeffdsfverg', 4),
 (3, 'egergwe', 'gwgwergwg', 34243242, 'wegewrgwe', 3),
 (4, 'gwegwerg', 'ewgwergwe', 3423423, 'werferb', 2)]

In [ ]:
connection.execute("PRAGMA foreign_keys = ON")
cursor.execute('select ')

In [44]:
cursor.execute('''
SELECT DISTINCT Doctor.*
FROM Doctor
JOIN Patients ON Doctor.id = Patients.doc_id
WHERE Patients.id IN (1, 2)
''')

# Fetch and print results
results = cursor.fetchall()
for row in results:
    print(row)

(1, 'john', 24234242, '32ggdfs')
(4, 'gfgsdfgs', 345345, 'dfsggs')

In [45]:
connection.close()